## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
ecs.tf
inputs.tf
security_groups.tf
```
```terraform
Plan: 25 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.cra_upd_cloudwatch_group`            |
|        | `aws_cloudwatch_log_stream.cra_upd_cloudwatch_stream`          |
|        | `aws_lb.cra_upd_ecs_alb`                                       |
|        | `aws_lb_listener.cra_upd_ecs_alb_listener`                     |
|        | `aws_lb_target_group.cra_upd_ecs_lb_target_group`              |
|        | `aws_security_group.cra_upd_ecs_sg`                            |
|        | `aws_security_group.cra_upd_loadbalancer_sg`                   |
|        | `aws_security_group_rule.cra_upd_sg_rule_egress_lb_to_ecs`     |
|        | `aws_security_group_rule.cra_upd_sg_rule_ingress_ecs_to_lb`    |
|        | `aws_security_group_rule.cra_upd_sg_rule_ingress_lb_to_ecs`    |
|        | `aws_security_group_rule.cra_upd_sg_rule_ingress_vpc_to_lb`    |
|        | `module.api_ecs.aws_appautoscaling_policy.this[&quot;cpu&quot;]`         |
|        | `module.api_ecs.aws_appautoscaling_policy.this[&quot;memory&quot;]`      |
|        | `module.api_ecs.aws_appautoscaling_target.this[0]`             |
|        | `module.api_ecs.aws_cloudwatch_log_group.this`                 |
|        | `module.api_ecs.aws_ecs_cluster.this[0]`                       |
|        | `module.api_ecs.aws_ecs_cluster_capacity_providers.this[0]`    |
|        | `module.api_ecs.aws_ecs_service.this`                          |
|        | `module.api_ecs.aws_ecs_task_definition.this`                  |
|        | `module.api_ecs.aws_iam_policy.this_task[0]`                   |
|        | `module.api_ecs.aws_iam_policy.this_task_exec`                 |
|        | `module.api_ecs.aws_iam_role.this_task`                        |
|        | `module.api_ecs.aws_iam_role.this_task_exec`                   |
|        | `module.api_ecs.aws_iam_role_policy_attachment.this_task[0]`   |
|        | `module.api_ecs.aws_iam_role_policy_attachment.this_task_exec` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cra-arc-upd-tbpc/actions/runs/15143157841).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cra_upd_cloudwatch_group will be created
  + resource "aws_cloudwatch_log_group" "cra_upd_cloudwatch_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/cra-upd-dashboard-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # aws_cloudwatch_log_stream.cra_upd_cloudwatch_stream will be created
  + resource "aws_cloudwatch_log_stream" "cra_upd_cloudwatch_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/cra-upd-dashboard-cluster"
      + name           = "cra-upd-dashboard-log-stream"
    }

  # aws_lb.cra_upd_ecs_alb will be created
  + resource "aws_lb" "cra_upd_ecs_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + null,
        ]
      + tags_all                                                     = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.cra_upd_ecs_alb_listener will be created
  + resource "aws_lb_listener" "cra_upd_ecs_alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.cra_upd_ecs_lb_target_group will be created
  + resource "aws_lb_target_group" "cra_upd_ecs_lb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 9000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + target_type                        = "ip"
        # (1 unchanged attribute hidden)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = (known after apply)
          + path                = "/api/_healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_security_group.cra_upd_ecs_sg will be created
  + resource "aws_security_group" "cra_upd_ecs_sg" {
      + arn                    = (known after apply)
      + description            = "ECS Security Group for CRA UPD"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.cra_upd_loadbalancer_sg will be created
  + resource "aws_security_group" "cra_upd_loadbalancer_sg" {
      + arn                    = (known after apply)
      + description            = "LoadBalancer Security Group for CRA UPD"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cra-upd-loadbalancer-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.cra_upd_sg_rule_egress_lb_to_ecs will be created
  + resource "aws_security_group_rule" "cra_upd_sg_rule_egress_lb_to_ecs" {
      + description              = "Allow egress from load balancer to ECS on port 9000"
      + from_port                = 9000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9000
      + type                     = "egress"
    }

  # aws_security_group_rule.cra_upd_sg_rule_ingress_ecs_to_lb will be created
  + resource "aws_security_group_rule" "cra_upd_sg_rule_ingress_ecs_to_lb" {
      + description              = "Allow ingress from ECS to load balancer on port 9000"
      + from_port                = 9000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9000
      + type                     = "ingress"
    }

  # aws_security_group_rule.cra_upd_sg_rule_ingress_lb_to_ecs will be created
  + resource "aws_security_group_rule" "cra_upd_sg_rule_ingress_lb_to_ecs" {
      + description              = "Allow ingress from load balancer to ECS on port 9000"
      + from_port                = 9000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9000
      + type                     = "ingress"
    }

  # aws_security_group_rule.cra_upd_sg_rule_ingress_vpc_to_lb will be created
  + resource "aws_security_group_rule" "cra_upd_sg_rule_ingress_vpc_to_lb" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow ingress from VPC on port 80"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.api_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "cra-upd-dashboard-app-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_combined[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:ListBucket",
                              + "s3:GetObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "/*",
                              + "",
                            ]
                          + Sid      = "AllowDataBucketReadAccess"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action = [
                              + "ssm:GetParametersByPath",
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                            ]
                          + Effect = "Allow"
                          + Sid    = "AllowSSMParameterAccess"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_ecr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_ecr" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.api_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.api_ecs.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.api_ecs.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/cra-upd-dashboard-cluster/cra-upd-dashboard-app-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.api_ecs.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/cra-upd-dashboard-cluster/cra-upd-dashboard-app-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.api_ecs.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 1
      + min_capacity       = 1
      + resource_id        = "service/cra-upd-dashboard-cluster/cra-upd-dashboard-app-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + suspended_state (known after apply)
    }

  # module.api_ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/cra-upd-dashboard-cluster/cra-upd-dashboard-app-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # module.api_ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "cra-upd-dashboard-cluster"
      + tags     = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.api_ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "cra-upd-dashboard-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.api_ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "cra-upd-dashboard-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = (known after apply)
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "cra-upd-dashboard-app-service"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer (known after apply)

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + null,
            ]
        }
    }

  # module.api_ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "cra-upd-dashboard-app-service"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.api_ecs.aws_iam_policy.this_task[0] will be created
  + resource "aws_iam_policy" "this_task" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cra-upd-dashboard-app-service_ecs_task_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # module.api_ecs.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cra-upd-dashboard-app-service_ecs_task_exec_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # module.api_ecs.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cra_upd_cloudwatch_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.cra_upd_ecs_alb"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.cra_upd_ecs_alb_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.cra_upd_ecs_lb_target_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_ecs_sg"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_loadbalancer_sg"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
